data/NASA_2DWMH_sweep/exp_tbl_sst_220/0/C
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2512                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volVectorField;
    location    "0";
    object      C;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<vector> 
180400
(
(-1.34758937076 0.000134863995161 7.41002489226e-19)
(-1.34276794173 0.000134867175497 2.57747835775e-19)
(-1.33794642743 0.000134865585385 5.60096578535e-19)
(-1.33312499839 0.000134865585338 1.36934088811e-19)
(-1.32830356936 0.000134865585385 4.39426145979e-19)
(-1.32348214033 0.000134865585432 4.60258943305e-19)
(-1.31866071129 0.000134865585385 5.70886767847e-19)
(-1.31383928226 0.000134865585385 1.36934088837e-19)
...
)
;

boundaryField
{
    inlet
    {
        type            calculated;
        value           nonuniform List<vector> 
220
(
(-1.35 0.000134865581096 6.19466892636e-21)
(-1.35 0.000406388503091 9.44352180507e-20)
(-1.35 0.000681518749158 5.29182103959e-20)
(-1.35 0.000960304244483 -9.75773502173e-20)
(-1.35 0.00124279355097 2.73639328356e-20)
(-1.35 0.00152903587568 -8.82836117868e-20)
(-1.35 0.00181908107943 -8.75809867399e-20)
(-1.35 0.00211297968545 5.47794239398e-20)
...
)
;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<vector> 
220
(
(0.84 0.000134865581096 -6.19466892636e-21)
(0.84 0.000406388503091 -9.44352180507e-20)
(0.84 0.000681518749158 -5.29182103959e-20)
(0.84 0.000960304244483 9.75773502173e-20)
(0.84 0.00124279355097 -2.73639328356e-20)
(0.84 0.00152903587568 8.82836117868e-20)
(0.84 0.00181908107943 8.75809867399e-20)
(0.84 0.00211297968545 -5.47794239398e-20)
...
)
;
    }
    bottomWall
    {
        type            calculated;
        value           nonuniform List<vector> 
820
(
(-1.34758928572 0 2.00543938836e-20)
(-1.34276785714 0 -8.24261355676e-20)
(-1.33794642858 0 2.00543938836e-20)
(-1.333125 0 7.86146963361e-20)
(-1.32830357142 0 2.00543938836e-20)
(-1.32348214285 0 -8.24261355676e-20)
(-1.31866071428 0 2.00543938836e-20)
(-1.31383928571 0 -8.24261355676e-20)
...
)
;
    }
    topWall
    {
        type            calculated;
        value           nonuniform List<vector> 
820
(
(-1.34780998998 0.35 -5.88676736236e-20)
(-1.34298736832 0.35 -7.49127520034e-20)
(-1.33794344586 0.35 -7.86038308964e-20)
(-1.33312082421 0.35 -7.86038308964e-20)
(-1.32829820256 0.35 1.26306521862e-19)
(-1.3234755809 0.35 -7.86038308964e-20)
(-1.31865295925 0.35 1.26306521862e-19)
(-1.31383033759 0.35 -1.07876738481e-19)
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
