data/NASA_2DWMH_sweep/exp_tbl_sst_220/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Website:  https://openfoam.org                  |
|   \\  /    A nd           | Version:  7                                     |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (34.6 0 0);

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           nonuniform List<vector>
        220
        (
            (20.80374073 0 0)
            (24.3389373 0 0)
            (26.18148587 0 0)
            (27.47069987 0 0)
            (28.47487269 0 0)
            (29.30298186 0 0)
            (30.01070496 0 0)
            (30.63052705 0 0)
...
        );
    }

    outlet
    {
        type            zeroGradient;
    }

    bottomWall
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    topWall
    {
        type            slip;
    }

    frontAndBack
    {
        type            empty;
    }
}

// ************************************************************************* //
