data/NASA_2DWMH_sweep/exp_tbl_sst_220/0/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Website:  https://openfoam.org                  |
|   \\  /    A nd           | Version:  7                                     |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0.179574;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           nonuniform List<scalar>
        220
        (
            4.208933585
            4.599307789
            4.196654348
            3.593768296
            2.958519527
            2.360783
            1.831594182
            1.382777183
...
        );
    }

    outlet
    {
        type            zeroGradient;
    }

    bottomWall
    {
        type            kqRWallFunction;
        value           uniform 0.179574;
    }

    topWall
    {
        type            zeroGradient;
    }

    frontAndBack
    {
        type            empty;
    }
}

// ************************************************************************* //
