data/NASA_2DWMH_sweep/exp_tbl_sst_220/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2512                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    inlet
    {
        type            patch;
        nFaces          220;
        startFace       359760;
    }
    outlet
    {
        type            patch;
        nFaces          220;
        startFace       359980;
    }
    bottomWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          820;
        startFace       360200;
    }
    topWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          820;
        startFace       361020;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          360800;
        startFace       361840;
    }
)

// ************************************************************************* //
